README.org
#+TITLE: *Iron Brush Tattoo* /Case Jewelry/
#+DATE: Tue May  3 10:45:24 CDT 2016
#+AUTHOR: AnderSon
#+OPTIONS: tags:nil

/Rails 4.2.6/

https://github.com/IronBrushTattoo/cj_rails.git

* Config

** Gemfile

   [[./Gemfile]]

   #+NAME: Gemfile
   #+begin_src ruby :tangle Gemfile :padline no
     source 'https://rubygems.org'

     gem 'rails', '4.2.6'
     gem 'pg', '~> 0.15'
     gem 'sass-rails', '~> 5.0'
     gem 'uglifier', '>= 1.3.0'
     gem 'coffee-rails', '~> 4.1.0'
     gem 'jquery-rails'
     gem 'turbolinks'
     gem 'jbuilder', '~> 2.0'
     gem 'sdoc', '~> 0.4.0', group: :doc
     gem 'dragonfly', '~> 1.0.12'
     gem 'rack-cache', :require => 'rack/cache'

     group :development, :test do
       gem 'byebug'
     end

     group :development do
       gem 'web-console', '~> 2.0'
       gem 'spring'
     end
   #+end_src

** Gems

   [[Dragonfly]]
   
** Environments

*** Development
*** Production
    
   [[./config/environments/production.rb]]

   #+NAME: production.rb
   #+begin_src ruby :tangle config/environments/production.rb :padline no
     Rails.application.configure do
       # Settings specified here will take precedence over those in config/application.rb.

       # Code is not reloaded between requests.
       config.cache_classes = true

       # Eager load code on boot. This eager loads most of Rails and
       # your application in memory, allowing both threaded web servers
       # and those relying on copy on write to perform better.
       # Rake tasks automatically ignore this option for performance.
       config.eager_load = true

       # Full error reports are disabled and caching is turned on.
       config.consider_all_requests_local       = false
       config.action_controller.perform_caching = true

       # Enable Rack::Cache to put a simple HTTP cache in front of your application
       # Add `rack-cache` to your Gemfile before enabling this.
       # For large-scale production use, consider using a caching reverse proxy like
       # NGINX, varnish or squid.
       config.action_dispatch.rack_cache = true

       # Disable serving static files from the `/public` folder by default since
       # Apache or NGINX already handles this.
       config.serve_static_files = ENV['RAILS_SERVE_STATIC_FILES'].present?

       # Compress JavaScripts and CSS.
       config.assets.js_compressor = :uglifier
       # config.assets.css_compressor = :sass

       # Do not fallback to assets pipeline if a precompiled asset is missed.
       config.assets.compile = false

       # Asset digests allow you to set far-future HTTP expiration dates on all assets,
       # yet still be able to expire them through the digest params.
       config.assets.digest = true

       # `config.assets.precompile` and `config.assets.version` have moved to config/initializers/assets.rb

       # Specifies the header that your server uses for sending files.
       # config.action_dispatch.x_sendfile_header = 'X-Sendfile' # for Apache
       # config.action_dispatch.x_sendfile_header = 'X-Accel-Redirect' # for NGINX

       # Force all access to the app over SSL, use Strict-Transport-Security, and use secure cookies.
       # config.force_ssl = true

       # Use the lowest log level to ensure availability of diagnostic information
       # when problems arise.
       config.log_level = :debug

       # Prepend all log lines with the following tags.
       # config.log_tags = [ :subdomain, :uuid ]

       # Use a different logger for distributed setups.
       # config.logger = ActiveSupport::TaggedLogging.new(SyslogLogger.new)

       # Use a different cache store in production.
       # config.cache_store = :mem_cache_store

       # Enable serving of images, stylesheets, and JavaScripts from an asset server.
       # config.action_controller.asset_host = 'http://assets.example.com'

       # Ignore bad email addresses and do not raise email delivery errors.
       # Set this to true and configure the email server for immediate delivery to raise delivery errors.
       # config.action_mailer.raise_delivery_errors = false

       # Enable locale fallbacks for I18n (makes lookups for any locale fall back to
       # the I18n.default_locale when a translation cannot be found).
       config.i18n.fallbacks = true

       # Send deprecation notices to registered listeners.
       config.active_support.deprecation = :notify

       # Use default logging formatter so that PID and timestamp are not suppressed.
       config.log_formatter = ::Logger::Formatter.new

       # Do not dump schema after migrations.
       config.active_record.dump_schema_after_migration = false
     end
   #+end_src
   
* First steps :rails_template:rails:rake:

  : rake db:migrate
  : rake db:setup
* Project

  The purpose of this application is to produce several pdf files from an xlsx file,
  as a re-implementation of https://github.com/IronBrushTattoo/cj as a web 
  application.

** User Story

   - user logs in ([[Authentication]])
     - users will be piercers
   - chooses xlsx file for upload
     [[File Upload]]
   - selects number of days back to make labels from
   - submits
     - BACKGROUND
       - cj-parser.rb does what it does...
         - [ ] rewrite in rails?
   - downloads sheets(pdf files)

