README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><b>Iron Brush Tattoo</b> <i>Case Jewelry</i></title>
<!-- 2016-05-03 Tue 23:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="AnderSon" />
</head>
<body>
<div id="content">
<h1 class="title"><b>Iron Brush Tattoo</b> <i>Case Jewelry</i></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Config</a>
<ul>
<li><a href="#sec-1-1">1.1. Gemfile</a></li>
<li><a href="#sec-1-2">1.2. Gems</a></li>
<li><a href="#sec-1-3">1.3. Environments</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Development</a></li>
<li><a href="#sec-1-3-2">1.3.2. Production</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. First steps</a></li>
<li><a href="#sec-3">3. Project</a>
<ul>
<li><a href="#sec-3-1">3.1. User Story</a></li>
<li><a href="#sec-3-2">3.2. File Upload</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Dragonfly</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. Authentication</a></li>
<li><a href="#sec-3-4">3.4. Views</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. Routes</a></li>
<li><a href="#sec-3-4-2">3.4.2. Static Pages</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5. Controllers</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. Pages</a></li>
<li><a href="#sec-3-5-2">3.5.2. Spreadsheets</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6. Models</a>
<ul>
<li><a href="#sec-3-6-1">3.6.1. Page</a></li>
<li><a href="#sec-3-6-2">3.6.2. Spreadsheet</a></li>
</ul>
</li>
<li><a href="#sec-3-7">3.7. <span class="todo TODO">TODO</span> </a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<i>Rails 4.2.6</i>
</p>

<p>
<a href="https://github.com/IronBrushTattoo/cj_rails.git">https://github.com/IronBrushTattoo/cj_rails.git</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Config</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Gemfile</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="./Gemfile">./Gemfile</a>
</p>

<div class="org-src-container">

<pre class="src src-ruby" id="Gemfile">source 'https://rubygems.org'

gem 'rails', '4.2.6'
gem 'pg', '~&gt; 0.15'
gem 'sass-rails', '~&gt; 5.0'
gem 'uglifier', '&gt;= 1.3.0'
gem 'coffee-rails', '~&gt; 4.1.0'
gem 'jquery-rails'
gem 'turbolinks'
gem 'jbuilder', '~&gt; 2.0'
gem 'sdoc', '~&gt; 0.4.0', group: :doc
gem 'dragonfly', '~&gt; 1.0.12'
gem 'rack-cache', :require =&gt; 'rack/cache'

group :development, :test do
  gem 'byebug'
end

group :development do
  gem 'web-console', '~&gt; 2.0'
  gem 'spring'
end
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Gems</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="#sec-3-2-1">3.2.1</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Environments</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Development</h4>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Production</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
<a href="./config/environments/production.rb">./config/environments/production.rb</a>
</p>

<div class="org-src-container">

<pre class="src src-ruby" id="production.rb">Rails.application.configure do
  # Settings specified here will take precedence over those in config/application.rb.

  # Code is not reloaded between requests.
  config.cache_classes = true

  # Eager load code on boot. This eager loads most of Rails and
  # your application in memory, allowing both threaded web servers
  # and those relying on copy on write to perform better.
  # Rake tasks automatically ignore this option for performance.
  config.eager_load = true

  # Full error reports are disabled and caching is turned on.
  config.consider_all_requests_local       = false
  config.action_controller.perform_caching = true

  # Enable Rack::Cache to put a simple HTTP cache in front of your application
  # Add `rack-cache` to your Gemfile before enabling this.
  # For large-scale production use, consider using a caching reverse proxy like
  # NGINX, varnish or squid.
  config.action_dispatch.rack_cache = true

  # Disable serving static files from the `/public` folder by default since
  # Apache or NGINX already handles this.
  config.serve_static_files = ENV['RAILS_SERVE_STATIC_FILES'].present?

  # Compress JavaScripts and CSS.
  config.assets.js_compressor = :uglifier
  # config.assets.css_compressor = :sass

  # Do not fallback to assets pipeline if a precompiled asset is missed.
  config.assets.compile = false

  # Asset digests allow you to set far-future HTTP expiration dates on all assets,
  # yet still be able to expire them through the digest params.
  config.assets.digest = true

  # `config.assets.precompile` and `config.assets.version` have moved to config/initializers/assets.rb

  # Specifies the header that your server uses for sending files.
  # config.action_dispatch.x_sendfile_header = 'X-Sendfile' # for Apache
  # config.action_dispatch.x_sendfile_header = 'X-Accel-Redirect' # for NGINX

  # Force all access to the app over SSL, use Strict-Transport-Security, and use secure cookies.
  # config.force_ssl = true

  # Use the lowest log level to ensure availability of diagnostic information
  # when problems arise.
  config.log_level = :debug

  # Prepend all log lines with the following tags.
  # config.log_tags = [ :subdomain, :uuid ]

  # Use a different logger for distributed setups.
  # config.logger = ActiveSupport::TaggedLogging.new(SyslogLogger.new)

  # Use a different cache store in production.
  # config.cache_store = :mem_cache_store

  # Enable serving of images, stylesheets, and JavaScripts from an asset server.
  # config.action_controller.asset_host = 'http://assets.example.com'

  # Ignore bad email addresses and do not raise email delivery errors.
  # Set this to true and configure the email server for immediate delivery to raise delivery errors.
  # config.action_mailer.raise_delivery_errors = false

  # Enable locale fallbacks for I18n (makes lookups for any locale fall back to
  # the I18n.default_locale when a translation cannot be found).
  config.i18n.fallbacks = true

  # Send deprecation notices to registered listeners.
  config.active_support.deprecation = :notify

  # Use default logging formatter so that PID and timestamp are not suppressed.
  config.log_formatter = ::Logger::Formatter.new

  # Do not dump schema after migrations.
  config.active_record.dump_schema_after_migration = false
end
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> First steps</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
rake db:migrate
rake db:setup
</pre>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Project</h2>
<div class="outline-text-2" id="text-3">
<p>
The purpose of this application is to produce several pdf files from an xlsx file,
as a re-implementation of <a href="https://github.com/IronBrushTattoo/cj">https://github.com/IronBrushTattoo/cj</a> as a web 
application.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> User Story</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>user logs in (<a href="#sec-3-3">3.3</a>)
<ul class="org-ul">
<li>users will be piercers
</li>
</ul>
</li>
<li>chooses xlsx file for upload
<a href="#sec-3-2">3.2</a>
</li>
<li>selects number of days back to make labels from
</li>
<li>submits
<ul class="org-ul">
<li>BACKGROUND
<ul class="org-ul">
<li>cj-parser.rb does what it does&#x2026;
<ul class="org-ul">
<li><code>[&#xa0;]</code> rewrite in rails?
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>downloads sheets(pdf files)
</li>
</ul>
</div>
</div>
