README.org
** File Upload

   - possible gems
     https://www.ruby-toolbox.com/categories/rails_file_uploads
     
     - paperclip
       - nb
         - used paperclip before
         - seemed to be designed specifically for image files
         - always worked well
     - carrierwave
       - nb
         - used before, but not thoroughly
           - i kind of remember having issues with it
     - dragonfly
       https://github.com/markevans/dragonfly
       http://markevans.github.io/dragonfly/
       http://markevans.github.io/dragonfly/rails/

       Dragonfly is a highly customizable ruby gem for handling images and other
       attachments and is already in use on thousands of websites

       [[Dragonfly]]

       - nb
         - used briefly before
           - i remember it being an easy configuration
     - attachment fu
       https://github.com/technoweenie/attachment_fu
       
       Treat an ActiveRecord model as a file attachment, storing its patch, size,
       content type, etc. http://weblog.technoweenie.net

       - nb
         - has not been maintained since Apr 25, 2009
     - refile
       - nb
         - was my next choice when previously working with file uploads
     - jquery.fileupload-rails
     - imagery
     - attached
     - papermill
     - fileuploader-rails
     - filecip
     - simple-image-uploader

*** Dragonfly
    
    http://markevans.github.io/dragonfly/rails/

**** Setup
     
     - [X] gem 'dragonfly', '~> 1.0.12'

       - [X] modify [[Gemfile]]

       - [X] bundle install

     - [X] rails g dragonfly

       generates config/initializers/dragonfly.rb

       [[./config/initializers/dragonfly.rb]]

       #+begin_src ruby :tangle config/initializers/dragonfly.rb :padline no
         require 'dragonfly'

         # Configure
         Dragonfly.app.configure do
           plugin :imagemagick

           secret "72245c7371d66ccca6f9356779fa16e3104e6676c1e57af987e9e3f92130dca5"

           url_format "/media/:job/:name"

           datastore :file,
             root_path: Rails.root.join('public/system/dragonfly', Rails.env),
             server_root: Rails.root.join('public')
         end

         # Logger
         Dragonfly.logger = Rails.logger

         # Mount as middleware
         Rails.application.middleware.use Dragonfly::Middleware

         # Add model functionality
         if defined?(ActiveRecord::Base)
           ActiveRecord::Base.extend Dragonfly::Model
           ActiveRecord::Base.extend Dragonfly::Model::Validations
         end
       #+end_src

