README.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> File Upload</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>possible gems
<a href="https://www.ruby-toolbox.com/categories/rails_file_uploads">https://www.ruby-toolbox.com/categories/rails_file_uploads</a>

<ul class="org-ul">
<li>paperclip
<ul class="org-ul">
<li>nb
<ul class="org-ul">
<li>used paperclip before
</li>
<li>seemed to be designed specifically for image files
</li>
<li>always worked well
</li>
</ul>
</li>
</ul>
</li>
<li>carrierwave
<ul class="org-ul">
<li>nb
<ul class="org-ul">
<li>used before, but not thoroughly
<ul class="org-ul">
<li>i kind of remember having issues with it
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>dragonfly
<a href="https://github.com/markevans/dragonfly">https://github.com/markevans/dragonfly</a>
<a href="http://markevans.github.io/dragonfly/">http://markevans.github.io/dragonfly/</a>
<a href="http://markevans.github.io/dragonfly/rails/">http://markevans.github.io/dragonfly/rails/</a>

<p>
Dragonfly is a highly customizable ruby gem for handling images and other
attachments and is already in use on thousands of websites
</p>

<p>
<a href="#sec-3-2-1">3.2.1</a>
</p>

<ul class="org-ul">
<li>nb
<ul class="org-ul">
<li>used briefly before
<ul class="org-ul">
<li>i remember it being an easy configuration
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>attachment fu
<a href="https://github.com/technoweenie/attachment_fu">https://github.com/technoweenie/attachment_fu</a>

<p>
Treat an ActiveRecord model as a file attachment, storing its patch, size,
content type, etc. <a href="http://weblog.technoweenie.net">http://weblog.technoweenie.net</a>
</p>

<ul class="org-ul">
<li>nb
<ul class="org-ul">
<li>has not been maintained since Apr 25, 2009
</li>
</ul>
</li>
</ul>
</li>
<li>refile
<ul class="org-ul">
<li>nb
<ul class="org-ul">
<li>was my next choice when previously working with file uploads
</li>
</ul>
</li>
</ul>
</li>
<li>jquery.fileupload-rails
</li>
<li>imagery
</li>
<li>attached
</li>
<li>papermill
</li>
<li>fileuploader-rails
</li>
<li>filecip
</li>
<li>simple-image-uploader
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Dragonfly</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
<a href="http://markevans.github.io/dragonfly/rails/">http://markevans.github.io/dragonfly/rails/</a>
</p>
</div>

<ol class="org-ol"><li><a id="sec-3-2-1-1" name="sec-3-2-1-1"></a>Setup<br  /><div class="outline-text-5" id="text-3-2-1-1">
<ul class="org-ul">
<li><code>[X]</code> gem 'dragonfly', '~&gt; 1.0.12'

<ul class="org-ul">
<li><code>[X]</code> modify <a href="#Gemfile">1</a>
</li>

<li><code>[X]</code> bundle install
</li>
</ul>
</li>

<li><code>[X]</code> rails g dragonfly

<p>
generates config/initializers/dragonfly.rb
</p>

<p>
<a href="./config/initializers/dragonfly.rb">./config/initializers/dragonfly.rb</a>
</p>

<div class="org-src-container">

<pre class="src src-ruby">require 'dragonfly'

# Configure
Dragonfly.app.configure do
  plugin :imagemagick

  secret "72245c7371d66ccca6f9356779fa16e3104e6676c1e57af987e9e3f92130dca5"

  url_format "/media/:job/:name"

  datastore :file,
    root_path: Rails.root.join('public/system/dragonfly', Rails.env),
    server_root: Rails.root.join('public')
end

# Logger
Dragonfly.logger = Rails.logger

# Mount as middleware
Rails.application.middleware.use Dragonfly::Middleware

# Add model functionality
if defined?(ActiveRecord::Base)
  ActiveRecord::Base.extend Dragonfly::Model
  ActiveRecord::Base.extend Dragonfly::Model::Validations
end
</pre>
</div>
</li>
</ul>
</div>
</li>
