README.org
**** Handling attachments

     - example (replace Photo model with Spreadsheet)
       
       Model: /Photo/
       
       - add /image/ attribute to Photo

         : class Photo < ActiveRecord::Base
         :   dragonfly_accessor :image  # defines a reader/writer for image
         :   # ...
         : end

       - needs /image_uid/ column, create migration with

         : rails g migration 
         
         : add_column :photos, :image_uid, :string
         : add_column :photos, :image_name, :string  # Optional - if you want 
         :                                           # urls to end with the 
         :                                           # original filename

       - view for uploading

         : app/views/photos/...

         : <% form_for @photo do |f| %>
         :   ...
         :   <%= f.file_field :image %>
         :   ...
         : <% end %>
         
       - allow parameter /image/ to be accepted by the controller

         : app/controllers/photos_controller.rb

         : params.require(:photo).permit(:image)

       - view for displaying

         : <%= image_tag @photo.image.thumb('400x200#').url if @photo.image_stored? %>

       - more can be done with [[http://markevans.github.io/dragonfly/models][models]]

     - Spreadsheet model sketch based on above example
       
       Model: /Spreadsheet/

       [[Spreadsheet]]
       
       - [X] add /file/ attribute to Spreadsheet

         : class Spreadsheet < ActiveRecord::Base
         :   dragonfly_accessor :file  # defines a reader/writer for file
         :   # ...
         : end

       - [X] needs /file_uid/ column, create migration with
         
         : rails g migration AddFileUidToSpreadsheets file_uid:string
         : rails g migration AddFileNameToSpreadsheets file_name:string

         [[./db/migrate/20160504011342_add_file_uid_to_spreadsheets.rb]]
         [[./db/migrate/20160504011542_add_file_name_to_spreadsheets.rb]]

         : add_column :spreadsheets, :file_uid, :string
         : add_column :spreadsheets, :file_name, :string  # Optional - if you want 
         :                                                # urls to end with the 
         :                                                # original filename

         : rake db:migrate

       - [X] view for uploading

         [[./app/views/spreadsheets/]]

         : <% form_for @spreadsheet do |f| %>
         :   ...
         :   <%= f.file_field :file %>
         :   ...
         : <% end %>
         
       - [X] allow parameter /file/ to be accepted by the controller

         [[./app/controllers/spreadsheets_controller.rb]]

         : params.require(:spreadsheet).permit(:file)

         #+NAME: spreadsheets controller
         #+begin_src ruby :tangle app/controllers/spreadsheets_controller.rb :padline no
           class SpreadsheetsController < ApplicationController
             before_action :set_spreadsheet, only: [:show, :edit, :update, :destroy]

             def index
               @spreadsheets = Spreadsheet.all
             end

             def show
             end

             def new
               @spreadsheet = Spreadsheet.new
             end

             def edit
             end

             def create
               @spreadsheet = Spreadsheet.new(spreadsheet_params)

               respond_to do |format|
                 if @spreadsheet.save
                   format.html { redirect_to @spreadsheet, notice: 'Spreadsheet was successfully created.' }
                   format.json { render :show, status: :created, location: @spreadsheet }
                 else
                   format.html { render :new }
                   format.json { render json: @spreadsheet.errors, status: :unprocessable_entity }
                 end
               end
             end

             def update
               respond_to do |format|
                 if @spreadsheet.update(spreadsheet_params)
                   format.html { redirect_to @spreadsheet, notice: 'Spreadsheet was successfully updated.' }
                   format.json { render :show, status: :ok, location: @spreadsheet }
                 else
                   format.html { render :edit }
                   format.json { render json: @spreadsheet.errors, status: :unprocessable_entity }
                 end
               end
             end

             def destroy
               @spreadsheet.destroy
               respond_to do |format|
                 format.html { redirect_to spreadsheets_url, notice: 'Spreadsheet was successfully destroyed.' }
                 format.json { head :no_content }
               end
             end

             private
             def set_spreadsheet
               @spreadsheet = Spreadsheet.find(params[:id])
             end

             def spreadsheet_params
               params.require(:spreadsheet).permit(:index, :file)
             end
           end

         #+end_src

       - [X] view for displaying

         [[./app/views/spreadsheets/show.html.erb]]
         [[./app/views/spreadsheets/index.html.erb]]

         : <%= @spreadsheet.file_name if @spreadsheet.file_stored? %>

       - more can be done with [[http://markevans.github.io/dragonfly/models][models]]

**** Caching

     - [X] [[Gemfile]]

       : gem 'rack-cache', :require => 'rack/cache'

       - [X] bundle install

     - [X] uncomment in [[Production]]

       : config.action_dispatch.rack_cache = true

**** Custom Endpoints

     [[Routes]]

     - [ ] text generation example
       
       : get "text/:text" => Dragonfly.app.endpoint { |params, app|
       :   app.generate(:text, params[:text], 'font-size' => 42)
       : }

     - [ ] endpoint callable from javascript (e.g. /image?file=egg.png&size=30x30)

       : get "image" => Dragonfly.app.endpoint { |params, app|
       :   app.fetch_file("some/dir/#{params[:file]}").thumb(params[:size])
       : }

** Authentication

   

** Views

