README.html

<li><a id="sec-3-2-1-2" name="sec-3-2-1-2"></a>Handling attachments<br  /><div class="outline-text-5" id="text-3-2-1-2">
<ul class="org-ul">
<li>example (replace Photo model with Spreadsheet)

<p>
Model: <i>Photo</i>
</p>

<ul class="org-ul">
<li>add <i>image</i> attribute to Photo

<pre class="example">
class Photo &lt; ActiveRecord::Base
  dragonfly_accessor :image  # defines a reader/writer for image
  # ...
end
</pre>
</li>

<li>needs <i>image<sub>uid</sub></i> column, create migration with

<pre class="example">
rails g migration 
</pre>

<pre class="example">
add_column :photos, :image_uid, :string
add_column :photos, :image_name, :string  # Optional - if you want 
                                          # urls to end with the 
                                          # original filename
</pre>
</li>

<li>view for uploading

<pre class="example">
app/views/photos/...
</pre>

<pre class="example">
&lt;% form_for @photo do |f| %&gt;
  ...
  &lt;%= f.file_field :image %&gt;
  ...
&lt;% end %&gt;
</pre>
</li>

<li>allow parameter <i>image</i> to be accepted by the controller

<pre class="example">
app/controllers/photos_controller.rb
</pre>

<pre class="example">
params.require(:photo).permit(:image)
</pre>
</li>

<li>view for displaying

<pre class="example">
&lt;%= image_tag @photo.image.thumb('400x200#').url if @photo.image_stored? %&gt;
</pre>
</li>

<li>more can be done with <a href="http://markevans.github.io/dragonfly/models">models</a>
</li>
</ul>
</li>

<li>Spreadsheet model sketch based on above example

<p>
Model: <i>Spreadsheet</i>
</p>

<p>
<a href="#sec-3-6-2">3.6.2</a>
</p>

<ul class="org-ul">
<li><code>[X]</code> add <i>file</i> attribute to Spreadsheet

<pre class="example">
class Spreadsheet &lt; ActiveRecord::Base
  dragonfly_accessor :file  # defines a reader/writer for file
  # ...
end
</pre>
</li>

<li><code>[X]</code> needs <i>file<sub>uid</sub></i> column, create migration with

<pre class="example">
rails g migration AddFileUidToSpreadsheets file_uid:string
rails g migration AddFileNameToSpreadsheets file_name:string
</pre>

<p>
<a href="./db/migrate/20160504011342_add_file_uid_to_spreadsheets.rb">./db/migrate/20160504011342_add_file_uid_to_spreadsheets.rb</a>
<a href="./db/migrate/20160504011542_add_file_name_to_spreadsheets.rb">./db/migrate/20160504011542_add_file_name_to_spreadsheets.rb</a>
</p>

<pre class="example">
add_column :spreadsheets, :file_uid, :string
add_column :spreadsheets, :file_name, :string  # Optional - if you want 
                                               # urls to end with the 
                                               # original filename
</pre>

<pre class="example">
rake db:migrate
</pre>
</li>

<li><code>[X]</code> view for uploading

<p>
<a href="./app/views/spreadsheets/">./app/views/spreadsheets/</a>
</p>

<pre class="example">
&lt;% form_for @spreadsheet do |f| %&gt;
  ...
  &lt;%= f.file_field :file %&gt;
  ...
&lt;% end %&gt;
</pre>
</li>

<li><code>[X]</code> allow parameter <i>file</i> to be accepted by the controller

<p>
<a href="./app/controllers/spreadsheets_controller.rb">./app/controllers/spreadsheets_controller.rb</a>
</p>

<pre class="example">
params.require(:spreadsheet).permit(:file)
</pre>

<div class="org-src-container">

<pre class="src src-ruby" id="spreadsheets-controller">class SpreadsheetsController &lt; ApplicationController
  before_action :set_spreadsheet, only: [:show, :edit, :update, :destroy]

  def index
    @spreadsheets = Spreadsheet.all
  end

  def show
  end

  def new
    @spreadsheet = Spreadsheet.new
  end

  def edit
  end

  def create
    @spreadsheet = Spreadsheet.new(spreadsheet_params)

    respond_to do |format|
      if @spreadsheet.save
        format.html { redirect_to @spreadsheet, notice: 'Spreadsheet was successfully created.' }
        format.json { render :show, status: :created, location: @spreadsheet }
      else
        format.html { render :new }
        format.json { render json: @spreadsheet.errors, status: :unprocessable_entity }
      end
    end
  end

  def update
    respond_to do |format|
      if @spreadsheet.update(spreadsheet_params)
        format.html { redirect_to @spreadsheet, notice: 'Spreadsheet was successfully updated.' }
        format.json { render :show, status: :ok, location: @spreadsheet }
      else
        format.html { render :edit }
        format.json { render json: @spreadsheet.errors, status: :unprocessable_entity }
      end
    end
  end

  def destroy
    @spreadsheet.destroy
    respond_to do |format|
      format.html { redirect_to spreadsheets_url, notice: 'Spreadsheet was successfully destroyed.' }
      format.json { head :no_content }
    end
  end

  private
  def set_spreadsheet
    @spreadsheet = Spreadsheet.find(params[:id])
  end

  def spreadsheet_params
    params.require(:spreadsheet).permit(:index, :file)
  end
end
</pre>
</div>
</li>

<li><code>[X]</code> view for displaying

<p>
<a href="./app/views/spreadsheets/show.html.erb">./app/views/spreadsheets/show.html.erb</a>
<a href="./app/views/spreadsheets/index.html.erb">./app/views/spreadsheets/index.html.erb</a>
</p>

<pre class="example">
&lt;%= @spreadsheet.file_name if @spreadsheet.file_stored? %&gt;
</pre>
</li>

<li>more can be done with <a href="http://markevans.github.io/dragonfly/models">models</a>
</li>
</ul>
</li>
</ul>
</div>
</li>

<li><a id="sec-3-2-1-3" name="sec-3-2-1-3"></a>Caching<br  /><div class="outline-text-5" id="text-3-2-1-3">
<ul class="org-ul">
<li><code>[X]</code> <a href="#Gemfile">1</a>

<pre class="example">
gem 'rack-cache', :require =&gt; 'rack/cache'
</pre>

<ul class="org-ul">
<li><code>[X]</code> bundle install
</li>
</ul>
</li>

<li><code>[X]</code> uncomment in <a href="#sec-1-3-2">1.3.2</a>

<pre class="example">
config.action_dispatch.rack_cache = true
</pre>
</li>
</ul>
</div>
</li>

<li><a id="sec-3-2-1-4" name="sec-3-2-1-4"></a>Custom Endpoints<br  /><div class="outline-text-5" id="text-3-2-1-4">
<p>
<a href="#sec-3-4-1">3.4.1</a>
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> text generation example

<pre class="example">
get "text/:text" =&gt; Dragonfly.app.endpoint { |params, app|
  app.generate(:text, params[:text], 'font-size' =&gt; 42)
}
</pre>
</li>

<li><code>[&#xa0;]</code> endpoint callable from javascript (e.g. /image?file=egg.png&amp;size=30x30)

<pre class="example">
get "image" =&gt; Dragonfly.app.endpoint { |params, app|
  app.fetch_file("some/dir/#{params[:file]}").thumb(params[:size])
}
</pre>
</li>
</ul>
</div>
</li></ol>
</div>
</div>
