README.org
*** Routes

    [[./config/routes.rb]]

    #+NAME: routes.rb
    #+begin_src ruby :tangle config/routes.rb :padline no
      Rails.application.routes.draw do
        root 'pages#home'

        resources :spreadsheets

        get "spreadsheets" => "spreadsheets#new"

        # The priority is based upon order of creation: first created -> highest priority.
        # See how all your routes lay out with "rake routes".

        # You can have the root of your site routed with "root"
        # root 'welcome#index'

        # Example of regular route:
        #   get 'products/:id' => 'catalog#view'

        # Example of named route that can be invoked with purchase_url(id: product.id)
        #   get 'products/:id/purchase' => 'catalog#purchase', as: :purchase

        # Example resource route (maps HTTP verbs to controller actions automatically):
        #   resources :products

        # Example resource route with options:
        #   resources :products do
        #     member do
        #       get 'short'
        #       post 'toggle'
        #     end
        #
        #     collection do
        #       get 'sold'
        #     end
        #   end

        # Example resource route with sub-resources:
        #   resources :products do
        #     resources :comments, :sales
        #     resource :seller
        #   end

        # Example resource route with more complex sub-resources:
        #   resources :products do
        #     resources :comments
        #     resources :sales do
        #       get 'recent', on: :collection
        #     end
        #   end

        # Example resource route with concerns:
        #   concern :toggleable do
        #     post 'toggle'
        #   end
        #   resources :posts, concerns: :toggleable
        #   resources :photos, concerns: :toggleable

        # Example resource route within a namespace:
        #   namespace :admin do
        #     # Directs /admin/products/* to Admin::ProductsController
        #     # (app/controllers/admin/products_controller.rb)
        #     resources :products
        #   end
      end
    #+end_src

    [[Custom Endpoints]]

*** Static Pages

    : root 'pages#home'    

    [[Pages]]

**** Home

     [[./app/views/pages/home.html.erb]]

** Controllers

*** Pages

    Static pages controller

    #+begin_src sh
      rails g controller pages --skip-assets
    #+end_src

    #+RESULTS:
    | create | app/controllers/pages_controller.rb       |
    | invoke | erb                                       |
    | create | app/views/pages                           |
    | invoke | test_unit                                 |
    | create | test/controllers/pages_controller_test.rb |
    | invoke | helper                                    |
    | create | app/helpers/pages_helper.rb               |
    | invoke | test_unit                                 |

*** Spreadsheets

** Models

*** Page
*** Spreadsheet

    [[./app/models/spreadsheet.rb]]

    #+NAME: spreadsheet.rb
    #+begin_src ruby :tangle app/models/spreadsheet.rb :padline no
      class Spreadsheet < ActiveRecord::Base
        dragonfly_accessor :file  # defines a reader/writer for file
      end
    #+end_src

** TODO

   - [ ] sidekiq
     - [ ] background processes for creating pdfs
   - [ ] requirements
     - [ ] roo
     - [ ] chronic
   - [ ] pdflatex
   - [ ] migrate code from cj-parser
   - [ ] user authentication
   - [ ] file upload
     - [ ] only xlsx file?
     - [ ] AWS
   - [ ] file storage
     - [ ] archival api?
       


