README.html

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Authentication</h3>
</div>



<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Views</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Routes</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
<a href="./config/routes.rb">./config/routes.rb</a>
</p>

<div class="org-src-container">

<pre class="src src-ruby" id="routes.rb">Rails.application.routes.draw do
  root 'pages#home'

  resources :spreadsheets

  get "spreadsheets" =&gt; "spreadsheets#new"

  # The priority is based upon order of creation: first created -&gt; highest priority.
  # See how all your routes lay out with "rake routes".

  # You can have the root of your site routed with "root"
  # root 'welcome#index'

  # Example of regular route:
  #   get 'products/:id' =&gt; 'catalog#view'

  # Example of named route that can be invoked with purchase_url(id: product.id)
  #   get 'products/:id/purchase' =&gt; 'catalog#purchase', as: :purchase

  # Example resource route (maps HTTP verbs to controller actions automatically):
  #   resources :products

  # Example resource route with options:
  #   resources :products do
  #     member do
  #       get 'short'
  #       post 'toggle'
  #     end
  #
  #     collection do
  #       get 'sold'
  #     end
  #   end

  # Example resource route with sub-resources:
  #   resources :products do
  #     resources :comments, :sales
  #     resource :seller
  #   end

  # Example resource route with more complex sub-resources:
  #   resources :products do
  #     resources :comments
  #     resources :sales do
  #       get 'recent', on: :collection
  #     end
  #   end

  # Example resource route with concerns:
  #   concern :toggleable do
  #     post 'toggle'
  #   end
  #   resources :posts, concerns: :toggleable
  #   resources :photos, concerns: :toggleable

  # Example resource route within a namespace:
  #   namespace :admin do
  #     # Directs /admin/products/* to Admin::ProductsController
  #     # (app/controllers/admin/products_controller.rb)
  #     resources :products
  #   end
end
</pre>
</div>

<p>
<a href="#sec-3-2-1-4">3.2.1.4</a>
</p>
</div>
</div>

<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> Static Pages</h4>
<div class="outline-text-4" id="text-3-4-2">
<pre class="example">
root 'pages#home'    
</pre>

<p>
<a href="#sec-3-5-1">3.5.1</a>
</p>
</div>

<ol class="org-ol"><li><a id="sec-3-4-2-1" name="sec-3-4-2-1"></a>Home<br  /><div class="outline-text-5" id="text-3-4-2-1">
<p>
<a href="./app/views/pages/home.html.erb">./app/views/pages/home.html.erb</a>
</p>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Controllers</h3>
<div class="outline-text-3" id="text-3-5">
</div><div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> Pages</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Static pages controller
</p>

<div class="org-src-container">

<pre class="src src-sh">rails g controller pages --skip-assets
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> Spreadsheets</h4>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Models</h3>
<div class="outline-text-3" id="text-3-6">
</div><div id="outline-container-sec-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> Page</h4>
</div>
<div id="outline-container-sec-3-6-2" class="outline-4">
<h4 id="sec-3-6-2"><span class="section-number-4">3.6.2</span> Spreadsheet</h4>
<div class="outline-text-4" id="text-3-6-2">
<p>
<a href="./app/models/spreadsheet.rb">./app/models/spreadsheet.rb</a>
</p>

<div class="org-src-container">

<pre class="src src-ruby" id="spreadsheet.rb">class Spreadsheet &lt; ActiveRecord::Base
  dragonfly_accessor :file  # defines a reader/writer for file
end
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> <span class="todo TODO">TODO</span> </h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li><code>[&#xa0;]</code> sidekiq
<ul class="org-ul">
<li><code>[&#xa0;]</code> background processes for creating pdfs
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> requirements
<ul class="org-ul">
<li><code>[&#xa0;]</code> roo
</li>
<li><code>[&#xa0;]</code> chronic
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> pdflatex
</li>
<li><code>[&#xa0;]</code> migrate code from cj-parser
</li>
<li><code>[&#xa0;]</code> user authentication
</li>
<li><code>[&#xa0;]</code> file upload
<ul class="org-ul">
<li><code>[&#xa0;]</code> only xlsx file?
</li>
<li><code>[&#xa0;]</code> AWS
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> file storage
<ul class="org-ul">
<li><code>[&#xa0;]</code> archival api?
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
